**** Example

We start with our input matrix.

#+HEADER: :results output verbatim
#+BEGIN_SRC sh
ls ./input
#+END_SRC

#+RESULTS:
: barcodes.tsv  genes.tsv  matrix.mtx

We also know where each cell came from, so we mark that down as well in a
=labels.csv= file.

#+CAPTION: labels.csv
#+BEGIN_EXAMPLE
item,label
TTTGTCATCGGCTTGG-1,Trachea
TTTGTCATCTTACCGC-1,Trachea
TTTGTCATCTTGTTTG-1,Trachea
...
#+END_EXAMPLE

We can now run the =too-many-cells= algorithm on our data.

#+BEGIN_SRC sh
too-many-cells make-tree \
    --matrix-path input \
    --labels-file labels.csv \
    --draw-leaf "DrawItem DrawLabel" \
    --output out
#+END_SRC

What if we want pie charts instead of showing each individual cell? We don't
have to recalculate the entire tree, we can just supply the previous results:

#+BEGIN_SRC sh
too-many-cells make-tree \
    --prior out \
    --matrix-path input \
    --labels-file labels.csv \
    --draw-leaf "DrawItem DrawLabel" \
    --draw-collection "PieChart" \
    --output out
#+END_SRC

What if we want to draw the gene expression onto the tree in another folder?

#+BEGIN_SRC sh
too-many-cells make-tree \
    --prior out \
    --matrix-path input \
    --labels-file labels.csv \
    --draw-leaf "DrawItem (DrawContinuous \"ENSG00000012048\")" \
    --output out_gene_expression
#+END_SRC

